In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = pd.read_csv(r"C:\Users\eakal\Desktop\DSL\DSL Projects\Salarys.csv")

In [4]:
data

   Experience  Salary  Department
0           1   10000         ICT
1           2   15000         ICT
2           3   20000  Accounting
3           4   25000   Economics
4           5   30000    Bio_tech
5           6   35000    Bio_tech
6           7   40000         ICT
7           8   45000  Accounting
8           9   50000   Economics
9          10   55000         ICT

In [5]:
data['Salary']

0    10000
1    15000
2    20000
3    25000
4    30000
5    35000
6    40000
7    45000
8    50000
9    55000
Name: Salary, dtype: int64

In [6]:
data['Department']

0           ICT
1           ICT
2    Accounting
3     Economics
4      Bio_tech
5      Bio_tech
6           ICT
7    Accounting
8     Economics
9           ICT
Name: Department, dtype: object

In [7]:
data['Department'].unique()

array(['ICT', 'Accounting', 'Economics', 'Bio_tech'], dtype=object)

In [10]:
data['Department'].value_counts()

ICT           4
Bio_tech      2
Accounting    2
Economics     2
Name: Department, dtype: int64

In [11]:
data

   Experience  Salary  Department
0           1   10000         ICT
1           2   15000         ICT
2           3   20000  Accounting
3           4   25000   Economics
4           5   30000    Bio_tech
5           6   35000    Bio_tech
6           7   40000         ICT
7           8   45000  Accounting
8           9   50000   Economics
9          10   55000         ICT

In [20]:
data['Department'].count

<bound method Series.count of 0           ICT
1           ICT
2    Accounting
3     Economics
4      Bio_tech
5      Bio_tech
6           ICT
7    Accounting
8     Economics
9           ICT
Name: Department, dtype: object>

In [21]:
data.describe()

       Experience       Salary
count    10.00000     10.00000
mean      5.50000  32500.00000
std       3.02765  15138.25177
min       1.00000  10000.00000
25%       3.25000  21250.00000
50%       5.50000  32500.00000
75%       7.75000  43750.00000
max      10.00000  55000.00000

In [22]:
data["Department"].describe()

count      10
unique      4
top       ICT
freq        4
Name: Department, dtype: object

In [26]:
data

   Experience  Salary  Department
0           1   10000         ICT
1           2   15000         ICT
2           3   20000  Accounting
3           4   25000   Economics
4           5   30000    Bio_tech
5           6   35000    Bio_tech
6           7   40000         ICT
7           8   45000  Accounting
8           9   50000   Economics
9          10   55000         ICT

In [25]:
data.sample(5)

   Experience  Salary  Department
2           3   20000  Accounting
9          10   55000         ICT
1           2   15000         ICT
3           4   25000   Economics
0           1   10000         ICT